ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/Examples/MDR1986VK01/sdio/FatFs/sdio_sd.c
/**
 ******************************************************************************
 * @file    sdio_sd.c
 * @author  Milandr Application Team
 * @version V1.2.0
 * @date    10/09/2021
 * @brief   This file provides a set of functions needed to manage the SDIO SD
  *         Card memory mounted on MDR1986VK01-EVAL evaluation board.
 ******************************************************************************
 * <br><br>
 *
 * THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
 * WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE
 * TIME. AS A RESULT, MILANDR SHALL NOT BE HELD LIABLE FOR ANY
 * DIRECT, INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING
 * FROM THE CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE
 * CODING INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
 *
 * <h2><center>&copy; COPYRIGHT 2022 Milandr</center></h2>
 */


/* Includes ------------------------------------------------------------------*/
#include "stdint.h"
#include "sdio_sd.h"
#include "MDR1986VK01_clk.h"


#define CH_TX  0
#define CH_RX  1
#define MUX_TX 1
#define MUX_RX 2

void dma_chmux(int channel,int mux_channel)
{
  mux_channel = (mux_channel<<(8*(channel%4)));

  if     (channel<4)  MDR_DMA->CHMUX[0] |= mux_channel;
  else if(channel<8)  MDR_DMA->CHMUX[1] |= mux_channel;
  else if(channel<12) MDR_DMA->CHMUX[2] |= mux_channel;
  else if(channel<16) MDR_DMA->CHMUX[3] |= mux_channel;
  else if(channel<20) MDR_DMA->CHMUX[4] |= mux_channel;
  else if(channel<24) MDR_DMA->CHMUX[5] |= mux_channel;
  else if(channel<28) MDR_DMA->CHMUX[6] |= mux_channel;
  else if(channel<32) MDR_DMA->CHMUX[7] |= mux_channel;
}

void DMA_DONE0_IRQHandler(void)
{
  SD_ProcessDMAIRQ();
}

void DMA_DONE1_IRQHandler(void)
{
  SD_ProcessDMAIRQ();
}

//volatile int INTERRUPT_FLAG;
void SDIO_IRQHandler(void)
{
  SD_ProcessIRQSrc();
}

typedef struct
{
  uint32_t SrcEndAddr;       /*!< Specifies the DMA channel source end address */

  uint32_t DstEndAddr;         /*!< Specifies the DMA channel destination end address. */

  uint32_t Control;             /*!< Specifies the DMA channel control data configuration. */

  uint32_t Unused;              /*!< Specifies the DMA channel unused memory. */

}DMA_CtrlDataTypeDef;
DMA_CtrlDataTypeDef DMA_PRI_STR[32] __attribute__ ((aligned(1024)));

uint8_t SD_Get_CLKDIV(uint32_t clk)
{
    uint8_t source;
    uint32_t clock, div;

    source = (MDR_CLK->SDIO_CLK>>28)&0xF;
    
    clock = CLK_GetSourceClk(source);
    
    clock /= (MDR_CLK->SDIO_CLK & 0xFFFF)+1;
    
    div = clock%clk ? clock/clk + 1 : clock/clk;
    
    div = div<2 ? 0 : div-2;

    return div;
}


/** @addtogroup __MDR1986VK01_BoardPeriph_Driver MDR1986VK01 Standard Peripherial Demoboard Driver
  * @{
  */

/** @addtogroup MDR1986VK01_EVAL_SDIO_SD
  * @brief      This file provides all the SD Card driver firmware functions.
  * @{
  */

/** @defgroup MDR1986VK01_EVAL_SDIO_SD_Private_Types
  * @{
  */

/** @} */ /* End of group MDR1986VK01_EVAL_SDIO_SD_Private_Types */


/** @defgroup SDIO_SD_Private_Defines
  * @{
  */

/**
  * @brief  SDIO Intialization Frequency (400KHz max)
  */
#define SDIO_INIT_CLK                    (400000)
/**
  * @brief  SDIO Data Transfer Frequency
  */
#define SDIO_TRANSFER_CLK                (10000000)  // 10 MHz

/**
  * @brief  SDIO Static flags, TimeOut, FIFO Address
  */
#define NULL 0
#define SDIO_STATIC_FLAGS               ((uint32_t)0x000005FF)
#define SDIO_CMD0TIMEOUT                ((uint32_t)0x00010000)

/**
  * @brief  Mask for errors Card Status R1 (OCR Register)
  */
#define SD_OCR_ADDR_OUT_OF_RANGE        ((uint32_t)0x80000000)
#define SD_OCR_ADDR_MISALIGNED          ((uint32_t)0x40000000)
#define SD_OCR_BLOCK_LEN_ERR            ((uint32_t)0x20000000)
#define SD_OCR_ERASE_SEQ_ERR            ((uint32_t)0x10000000)
#define SD_OCR_BAD_ERASE_PARAM          ((uint32_t)0x08000000)
#define SD_OCR_WRITE_PROT_VIOLATION     ((uint32_t)0x04000000)
#define SD_OCR_LOCK_UNLOCK_FAILED       ((uint32_t)0x01000000)
#define SD_OCR_COM_CRC_FAILED           ((uint32_t)0x00800000)
#define SD_OCR_ILLEGAL_CMD              ((uint32_t)0x00400000)
#define SD_OCR_CARD_ECC_FAILED          ((uint32_t)0x00200000)
#define SD_OCR_CC_ERROR                 ((uint32_t)0x00100000)
#define SD_OCR_GENERAL_UNKNOWN_ERROR    ((uint32_t)0x00080000)
#define SD_OCR_STREAM_READ_UNDERRUN     ((uint32_t)0x00040000)
#define SD_OCR_STREAM_WRITE_OVERRUN     ((uint32_t)0x00020000)
#define SD_OCR_CID_CSD_OVERWRIETE       ((uint32_t)0x00010000)
#define SD_OCR_WP_ERASE_SKIP            ((uint32_t)0x00008000)
#define SD_OCR_CARD_ECC_DISABLED        ((uint32_t)0x00004000)
#define SD_OCR_ERASE_RESET              ((uint32_t)0x00002000)
#define SD_OCR_AKE_SEQ_ERROR            ((uint32_t)0x00000008)
#define SD_OCR_ERRORBITS                ((uint32_t)0xFDFFE008)

/**
  * @brief  Masks for R6 Response
  */
#define SD_R6_GENERAL_UNKNOWN_ERROR     ((uint32_t)0x00002000)
#define SD_R6_ILLEGAL_CMD               ((uint32_t)0x00004000)
#define SD_R6_COM_CRC_FAILED            ((uint32_t)0x00008000)

#define SD_VOLTAGE_WINDOW_SD            ((uint32_t)0x80100000)
#define SD_HIGH_CAPACITY                ((uint32_t)0x40000000)
#define SD_STD_CAPACITY                 ((uint32_t)0x00000000)
#define SD_CHECK_PATTERN                ((uint32_t)0x000001AA)

#define SD_MAX_VOLT_TRIAL               ((uint32_t)0x0000FFFF)
#define SD_ALLZERO                      ((uint32_t)0x00000000)

#define SD_WIDE_BUS_SUPPORT             ((uint32_t)0x00040000)
#define SD_SINGLE_BUS_SUPPORT           ((uint32_t)0x00010000)
#define SD_CARD_LOCKED                  ((uint32_t)0x02000000)

#define SD_DATATIMEOUT                  ((uint32_t)0xFFFFFFFF)
#define SD_0TO7BITS                     ((uint32_t)0x000000FF)
#define SD_8TO15BITS                    ((uint32_t)0x0000FF00)
#define SD_16TO23BITS                   ((uint32_t)0x00FF0000)
#define SD_24TO31BITS                   ((uint32_t)0xFF000000)
#define SD_MAX_DATA_LENGTH              ((uint32_t)0x01FFFFFF)

