ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/Examples/MDR1986VK01/sdio/FatFs/sdio_sd.c
#define SD_HALFFIFO                     ((uint32_t)0x00000008)
#define SD_HALFFIFOBYTES                ((uint32_t)0x00000020)

/**
  * @brief  Command Class Supported
  */
#define SD_CCCC_LOCK_UNLOCK             ((uint32_t)0x00000080)
#define SD_CCCC_WRITE_PROT              ((uint32_t)0x00000040)
#define SD_CCCC_ERASE                   ((uint32_t)0x00000020)

/**
  * @brief  Following commands are SD Card Specific commands.
  *         SDIO_APP_CMD should be sent before sending these commands.
  */
#define SDIO_SEND_IF_COND               ((uint32_t)0x00000008)

/** @} */ /* End of group SDIO_SD_Private_Defines */

/** @defgroup SDIO_SD_Private_Macros
  * @{
  */

/** @} */ /* End of group SDIO_SD_Private_Macros */

/** @defgroup SDIO_SD_Private_Variables
  * @{
  */

static uint32_t CardType =  SDIO_STD_CAPACITY_SD_CARD_V1_1;
static uint32_t CSD_Tab[4], CID_Tab[4], RCA = 0;
static uint8_t SDSTATUS_Tab[16];
__IO uint32_t StopCondition = 0;
__IO SD_Error TransferError = SD_OK;
__IO uint32_t TransferEnd = 0, DMAEndOfTransfer = 0;
SD_CardInfo SDCardInfo;

SDIO_InitTypeDef SDIO_InitStructure;
SDIO_CmdInitTypeDef SDIO_CmdInitStructure;
SDIO_DataInitTypeDef SDIO_DataInitStructure;

/** @} */ /* End of group SDIO_SD_Private_Variables */

/** @defgroup MDR1986VK01_EVAL_SDIO_SD_Private_Function_Prototypes
  * @{
  */

static SD_Error CmdError(void);
static SD_Error CmdResp1Error(uint8_t cmd);
static SD_Error CmdResp7Error(void);
static SD_Error CmdResp3Error(void);
static SD_Error CmdResp2Error(void);
static SD_Error CmdResp6Error(uint8_t cmd, uint16_t *prca);
static SD_Error SDEnWideBus(FunctionalState NewState);
static SD_Error IsCardProgramming(uint8_t *pstatus);
static SD_Error FindSCR(uint16_t rca, uint32_t *pscr);
uint8_t convert_from_bytes_to_power_of_two(uint16_t NumberOfBytes);

/** @} */ /* End of group MDR1986VK01_EVAL_SDIO_SD_Private_Function_Prototypes */

/** @defgroup @defgroup MDR1986VK01_EVAL_SDIO_SD_Private_Functions
  * @{
  */

/**
  * @brief  DeInitializes the SDIO interface.
  * @param  None
  * @retval None
  */
void SD_LowLevel_DeInit(void)
{
    
}

/**
  * @brief  Initializes the SD Card and put it into StandBy State (Ready for
  *         data transfer).
  * @param  None
  * @retval None
  */
void SD_LowLevel_Init(void)
{
}


/**
  * @brief  Configures the DMA Channel CH_TX for SDIO Tx request.
  * @param  BufferSRC: pointer to the source buffer
  * @param  BufferSize: buffer size
  * @retval None
  */
void SD_LowLevel_DMA_TxConfig(uint32_t *BufferSRC, uint32_t BufferSize)
{
  dma_chmux(CH_TX, MUX_TX);
  DMA_PRI_STR[CH_TX].SrcEndAddr = (uint32_t)&(BufferSRC[BufferSize/4-1]);
  DMA_PRI_STR[CH_TX].DstEndAddr = (uint32_t)&(MDR_SDIO->FIFO);
  DMA_PRI_STR[CH_TX].Control    = 0xEA000001 | (((BufferSize/4)-1)<<4)|(2<<14); // 2^3 words = half FIFO

  MDR_DMA->CONFIG |= 0x1;
  MDR_DMA->CHNL_REQ_MASK_CLR = (1<<CH_TX);
  MDR_DMA->CHNL_USEBURST_CLR = (1<<CH_TX);
  MDR_DMA->CHNL_ENABLE_CLR =   (1<<CH_TX);
  MDR_DMA->ERR_CLR =           (1<<CH_TX);
  MDR_DMA->CTRL_BASE_PTR = (uint32_t)&DMA_PRI_STR;

  MDR_DMA->CHNL_PRIORITY_SET = (1<<CH_TX);
  MDR_DMA->CHNL_PRI_ALT_CLR =  (1<<CH_TX);
  MDR_DMA->CHNL_REQ_MASK_CLR = (1<<CH_TX);
  MDR_DMA->CHNL_USEBURST_SET = (1<<CH_TX);//Enable SREQ
  MDR_DMA->CHNL_ENABLE_SET =   (1<<CH_TX);

}

/**
  * @brief  Configures the DMA Channel CH_RX for SDIO Rx request.
  * @param  BufferDST: pointer to the destination buffer
  * @param  BufferSize: buffer size
  * @retval None
  */
void SD_LowLevel_DMA_RxConfig(uint32_t *BufferDST, uint32_t BufferSize)
{
  DMA_PRI_STR[CH_RX].SrcEndAddr = (uint32_t)&(MDR_SDIO->FIFO);
  DMA_PRI_STR[CH_RX].DstEndAddr = (uint32_t)(&(BufferDST[BufferSize/4-1]));
  DMA_PRI_STR[CH_RX].Control    = 0xAE000001 | (((BufferSize/4)-1)<<4)|(3<<14); // 2^3 words = half FIFO

  MDR_DMA->CONFIG |= 0x1;
  MDR_DMA->CHNL_REQ_MASK_SET = (1<<CH_RX);
  MDR_DMA->CHNL_USEBURST_CLR = (1<<CH_RX);
  MDR_DMA->CHNL_ENABLE_CLR =   (1<<CH_RX);
  MDR_DMA->ERR_CLR =           (1<<CH_RX);
  MDR_DMA->CTRL_BASE_PTR = (uint32_t)&DMA_PRI_STR;

  dma_chmux(CH_RX, MUX_RX);

  MDR_DMA->CHNL_PRIORITY_SET = (1<<CH_RX);
  MDR_DMA->CHNL_PRI_ALT_CLR =  (1<<CH_RX);
  MDR_DMA->CHNL_REQ_MASK_CLR = (1<<CH_RX);
  MDR_DMA->CHNL_USEBURST_SET = (1<<CH_RX);//Enable SREQ
  MDR_DMA->CHNL_ENABLE_SET =   (1<<CH_RX);
}

/** @defgroup MDR1986VK01_EVAL_SDIO_SD_Private_Functions
  * @{
  */

/**
  * @brief  DeInitializes the SDIO interface.
  * @param  None
  * @retval None
  */
void SD_DeInit(void)
{
  SD_LowLevel_DeInit();
}

/**
  * @brief  Initializes the SD Card and put it into StandBy State (Ready for data
  *         transfer).
  * @param  None
  * @retval SD_Error: SD Card Error code.
  */
SD_Error SD_Init(void)
{
  __IO SD_Error errorstatus = SD_OK;

  /* SDIO Peripheral Low Level Init */
  //SD_LowLevel_Init();

  SDIO_DeInit();

  errorstatus = SD_PowerON();

  if (errorstatus != SD_OK)
  {
    /*!< CMD Response TimeOut (wait for CMDSENT flag) */
    return(errorstatus);
  }

  errorstatus = SD_InitializeCards();

  if (errorstatus != SD_OK)
  {
    /*!< CMD Response TimeOut (wait for CMDSENT flag) */
    return(errorstatus);
  }

  /*!< Configure the SDIO peripheral */
  /*!< SDIO_CK = SDIOCLK / (SDIO_TRANSFER_CLK_DIV + 2) */
  SDIO_InitStructure.SDIO_ClockDiv = SD_Get_CLKDIV(SDIO_TRANSFER_CLK);
  SDIO_InitStructure.SDIO_ClockEdge = SDIO_ClockEdge_Rising;
  SDIO_InitStructure.SDIO_ClockBypass = SDIO_ClockBypass_Disable;
  SDIO_InitStructure.SDIO_ClockPowerSave = SDIO_ClockPowerSave_Disable;
  SDIO_InitStructure.SDIO_BusWide = SDIO_BusWide_1b;
  SDIO_InitStructure.SDIO_HardwareFlowControl = SDIO_HardwareFlowControl_Enable;
  SDIO_Init(&SDIO_InitStructure);

  /*----------------- Read CSD/CID MSD registers ------------------*/
  errorstatus = SD_GetCardInfo(&SDCardInfo);

  if (errorstatus == SD_OK)
  {
    /*----------------- Select Card --------------------------------*/
    errorstatus = SD_SelectDeselect((uint32_t) (SDCardInfo.RCA << 16));
  }

  if (errorstatus == SD_OK)
  {
    errorstatus = SD_EnableWideBusOperation(SDIO_BusWide_4b); // Transfer mode
  }

  return(errorstatus);
}

/**
  * @brief  Gets the current sd card data transfer status.
  * @param  None
  * @retval SDTransferState: Data Transfer state.
  *   This value can be:
  *        - SD_TRANSFER_OK: No data transfer is acting
  *        - SD_TRANSFER_BUSY: Data transfer is acting
  */
SDTransferState SD_GetStatus(void)
{
  SDCardState cardstate =  SD_CARD_TRANSFER;

